Autodesk.Revit.DB.FailureDefinitionRegistry.FindFailureDefinition(Autodesk.Revit.DB.FailureDefinitionId)
Finds a specific FailureDefinition by a given FailureDefinitionId.
id:
The id of the FailureDefinition.
Returns:
The accessor of the found FailureDefinition, or null, if the FailureDefinition was not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011